In [3]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [7]:
df = pd.read_csv("train.csv")
df

,area,bedrooms,age,price,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,3000.0,4.0,15.0,565000.0,NaN,NaN,NaN,NaN,NaN,NaN
1,3200.0,NaN,18.0,610000.0,NaN,NaN,NaN,NaN,NaN,NaN
2,3600.0,3.0,30.0,595000.0,NaN,NaN,NaN,NaN,NaN,NaN
3,4000.0,5.0,8.0,760000.0,NaN,NaN,NaN,NaN,NaN,NaN
4,4100.0,6.0,8.0,810000.0,NaN,NaN,NaN,NaN,NaN,NaN
5,2600.0,3.0,20.0,550000.0,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
df = df.head(6)

In [13]:
df

,area,bedrooms,age,price,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,3000.0,4.0,15.0,565000.0,NaN,NaN,NaN,NaN,NaN,NaN
1,3200.0,NaN,18.0,610000.0,NaN,NaN,NaN,NaN,NaN,NaN
2,3600.0,3.0,30.0,595000.0,NaN,NaN,NaN,NaN,NaN,NaN
3,4000.0,5.0,8.0,760000.0,NaN,NaN,NaN,NaN,NaN,NaN
4,4100.0,6.0,8.0,810000.0,NaN,NaN,NaN,NaN,NaN,NaN
5,2600.0,3.0,20.0,550000.0,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
new_df = df[['area','bedrooms','age','price']]

In [16]:
new_df

     area  bedrooms   age     price
0  3000.0       4.0  15.0  565000.0
1  3200.0       NaN  18.0  610000.0
2  3600.0       3.0  30.0  595000.0
3  4000.0       5.0   8.0  760000.0
4  4100.0       6.0   8.0  810000.0
5  2600.0       3.0  20.0  550000.0

In [ ]:
#Seems bedrooms are missing then we can sue median to add those value

In [17]:
import math
median_bedrooms = math.floor(new_df.bedrooms.median())
median_bedrooms

4

In [20]:
new_df.bedrooms=new_df.bedrooms.fillna(median_bedrooms)

C:\Users\arai5\anaconda3\lib\site-packages\pandas\core\generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [28]:
new_df=new_df.astype({'bedrooms':'int','age':'int','price':'int'})

In [29]:
new_df

     area  bedrooms  age   price
0  3000.0         4   15  565000
1  3200.0         4   18  610000
2  3600.0         3   30  595000
3  4000.0         5    8  760000
4  4100.0         6    8  810000
5  2600.0         3   20  550000

In [31]:
reg = linear_model.LinearRegression()
reg.fit(new_df[['area','bedrooms','age']],new_df.price)

LinearRegression()

In [32]:
reg.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [ ]:
#these are m1,m2 and m3

In [33]:
reg.intercept_

221323.0018654036

In [34]:
reg.predict([[3000,3,40]])

array([498408.25158031])

In [ ]:
# y = m1*x1+m2*x2+m3*x3